In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [41]:
df = pd.read_csv("purchase_data.csv")
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10.0,A,2,0.0,3.0,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10.0,A,2,0.0,1.0,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10.0,A,2,0.0,12.0,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10.0,A,2,0.0,12.0,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16.0,C,4+,0.0,8.0,NaN,NaN,7969.0
...,...,...,...,...,...,...,...,...,...,...,...,...
263010,1004473,P00041942,M,36-45,1.0,B,3,0.0,5.0,18.0,NaN,3722.0
263011,1004473,P00115142,M,36-45,1.0,B,3,0.0,1.0,8.0,17.0,19253.0
263012,1004473,P00188442,M,36-45,1.0,B,3,0.0,5.0,7.0,NaN,3608.0
263013,1004473,P00119442,M,36-45,1.0,B,3,0.0,5.0,NaN,NaN,3604.0
263014,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [42]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10.0,A,2,0.0,3.0,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10.0,A,2,0.0,1.0,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10.0,A,2,0.0,12.0,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10.0,A,2,0.0,12.0,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16.0,C,4+,0.0,8.0,NaN,NaN,7969.0

In [47]:
df.isnull().sum()

User_ID                            0
Product_ID                         1
Gender                             1
Age                                1
Occupation                         1
City_Category                      1
Stay_In_Current_City_Years         1
Marital_Status                     1
Product_Category_1                 1
Product_Category_2             81514
Product_Category_3            182433
Purchase                           1
dtype: int64

In [48]:
df.isnull().sum().sum()

np.int64(263956)

In [49]:
df.shape

(263015, 12)

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263015 entries, 0 to 263014
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     263015 non-null  int64
 1   Product_ID                  263014 non-null  object
 2   Gender                      263014 non-null  object
 3   Age                         263014 non-null  object
 4   Occupation                  263014 non-null  float64
 5   City_Category               263014 non-null  object
 6   Stay_In_Current_City_Years  263014 non-null  object
 7   Marital_Status              263014 non-null  float64
 8   Product_Category_1          263014 non-null  float64
 9   Product_Category_2          181501 non-null  float64
 10  Product_Category_3          80582 non-null   float64
 11  Purchase                    263014 non-null  float64
dtypes: float64(6), int64(1), object(5)
memory usage: 24.1+ MB

In [51]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0', nan], dtype=object)

In [52]:
df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].replace("4+", 4)

In [53]:
df['Stay_In_Current_City_Years'].unique()

array(['2', 4, '3', '1', '0', nan], dtype=object)

In [54]:
df['Stay_In_Current_City_Years'] = pd.to_numeric(df['Stay_In_Current_City_Years'], errors = 'coerce')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263015 entries, 0 to 263014
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     263015 non-null  int64
 1   Product_ID                  263014 non-null  object
 2   Gender                      263014 non-null  object
 3   Age                         263014 non-null  object
 4   Occupation                  263014 non-null  float64
 5   City_Category               263014 non-null  object
 6   Stay_In_Current_City_Years  263014 non-null  float64
 7   Marital_Status              263014 non-null  float64
 8   Product_Category_1          263014 non-null  float64
 9   Product_Category_2          181501 non-null  float64
 10  Product_Category_3          80582 non-null   float64
 11  Purchase                    263014 non-null  float64
dtypes: float64(7), int64(1), object(4)
memory usage: 24.1+ MB

In [56]:
df.isnull().sum().sum()

np.int64(263956)

In [57]:
df['Product_Category_2'].fillna(0, inplace = True)
df['Product_Category_3'].fillna(0, inplace = True)

C:\Users\karan\AppData\Local\Temp\ipykernel_4556\1880039324.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Product_Category_2'].fillna(0, inplace = True)
C:\Users\karan\AppData\Local\Temp\ipykernel_4556\1880039324.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Product_Category_3'].fillna(0, inplace = True)

In [58]:
df.isnull().sum().sum()

np.int64(9)

In [59]:
df.isnull().sum()

User_ID                       0
Product_ID                    1
Gender                        1
Age                           1
Occupation                    1
City_Category                 1
Stay_In_Current_City_Years    1
Marital_Status                1
Product_Category_1            1
Product_Category_2            0
Product_Category_3            0
Purchase                      1
dtype: int64

In [60]:
df.dropna(inplace = True)

In [61]:
df.isnull().sum().sum()

np.int64(0)

In [62]:
df.shape

(263014, 12)

In [63]:
from sklearn.preprocessing import LabelEncoder

In [64]:
le = LabelEncoder()

In [65]:
for i in df.columns:
    if df[i].dtype == "object":
        df[i] = le.fit_transform(df[i])

In [66]:
df.head(3)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,647,0,0,10.0,0,2.0,0.0,3.0,0.0,0.0,8370.0
1,1000001,2304,0,0,10.0,0,2.0,0.0,1.0,6.0,14.0,15200.0
2,1000001,814,0,0,10.0,0,2.0,0.0,12.0,0.0,0.0,1422.0

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 263014 entries, 0 to 263013
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     263014 non-null  int64
 1   Product_ID                  263014 non-null  int64
 2   Gender                      263014 non-null  int64
 3   Age                         263014 non-null  int64
 4   Occupation                  263014 non-null  float64
 5   City_Category               263014 non-null  int64
 6   Stay_In_Current_City_Years  263014 non-null  float64
 7   Marital_Status              263014 non-null  float64
 8   Product_Category_1          263014 non-null  float64
 9   Product_Category_2          263014 non-null  float64
 10  Product_Category_3          263014 non-null  float64
 11  Purchase                    263014 non-null  float64
dtypes: float64(7), int64(5)
memory usage: 26.1 MB

In [68]:
# Steps to perform Data-Analysis
# Data Collection
# Preparing Samples
# Create Null and Alternate Hypthesis
# Apply appropriate test as per the problemn statement
# P-Value

It was observed that the average purchase made by men of the age 18-25 was 10000, Is it still the same

In [69]:
new_data = df[(df['Age'] == 1) & df['Gender'] == 1]
new_data

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
97,1000021,2024,1,1,16.0,1,0.0,0.0,3.0,12.0,0.0,3055.0
98,1000022,3261,1,1,15.0,0,4.0,0.0,1.0,8.0,17.0,12099.0
99,1000022,1954,1,1,15.0,0,4.0,0.0,5.0,8.0,0.0,8797.0
100,1000022,1792,1,1,15.0,0,4.0,0.0,3.0,4.0,0.0,10681.0
101,1000022,1020,1,1,15.0,0,4.0,0.0,8.0,14.0,0.0,7801.0
...,...,...,...,...,...,...,...,...,...,...,...,...
262767,1004446,1311,1,1,18.0,1,1.0,1.0,1.0,2.0,0.0,15431.0
262951,1004465,2880,1,1,4.0,0,1.0,1.0,5.0,0.0,0.0,1763.0
262952,1004465,1296,1,1,4.0,0,1.0,1.0,2.0,3.0,4.0,3240.0
262953,1004465,2733,1,1,4.0,0,1.0,1.0,8.0,0.0,0.0,5832.0
262954,1004465,1424,1,1,4.0,0,1.0,1.0,8.0,0.0,0.0,7788.0

In [80]:
sample = new_data.sample(3600, random_state = 50)
sample

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
192406,1005730,2326,1,1,0.0,0,3.0,0.0,5.0,11.0,0.0,3476.0
111004,1005094,427,1,1,10.0,2,4.0,1.0,1.0,16.0,0.0,19040.0
2272,1000352,2611,1,1,4.0,0,0.0,0.0,6.0,8.0,0.0,16218.0
68665,1004495,1734,1,1,4.0,2,1.0,1.0,3.0,4.0,5.0,10684.0
174177,1002950,3085,1,1,0.0,2,4.0,0.0,5.0,8.0,0.0,1981.0
...,...,...,...,...,...,...,...,...,...,...,...,...
25068,1003850,2168,1,1,3.0,1,0.0,0.0,5.0,6.0,16.0,8836.0
234864,1000202,2694,1,1,4.0,0,3.0,0.0,1.0,8.0,0.0,15548.0
151388,1005394,1417,1,1,0.0,0,2.0,0.0,8.0,0.0,0.0,10059.0
152503,1005568,660,1,1,4.0,2,3.0,0.0,1.0,2.0,14.0,15782.0
123599,1001112,499,1,1,6.0,0,4.0,0.0,8.0,0.0,0.0,10035.0

In [81]:
# null - the average purchase is same
# alt - the average puchase is not the same

In [82]:
# import any test
from scipy.stats import ttest_1samp
a_mean = 10000

In [83]:
t_stat, p_val = ttest_1samp(sample['Purchase'], a_mean)
print(p_val)

4.7205063212345295e-14

In [ ]:
# as te p-value < 0.05 so we are rejecting the null hypo and considering that the average purchase is not same

Is the average purchase made by men and women of the age 18-25 same

In [84]:
#null - avg purchase is equal
#alt - avg purchase is not equal

In [85]:
dfm = df.loc[(df['Gender'] == 1) & (df['Age'] == 1)]
dfw = df.loc[(df['Gender'] == 0) & (df['Age'] == 1)]

In [86]:
dfm

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
97,1000021,2024,1,1,16.0,1,0.0,0.0,3.0,12.0,0.0,3055.0
98,1000022,3261,1,1,15.0,0,4.0,0.0,1.0,8.0,17.0,12099.0
99,1000022,1954,1,1,15.0,0,4.0,0.0,5.0,8.0,0.0,8797.0
100,1000022,1792,1,1,15.0,0,4.0,0.0,3.0,4.0,0.0,10681.0
101,1000022,1020,1,1,15.0,0,4.0,0.0,8.0,14.0,0.0,7801.0
...,...,...,...,...,...,...,...,...,...,...,...,...
262767,1004446,1311,1,1,18.0,1,1.0,1.0,1.0,2.0,0.0,15431.0
262951,1004465,2880,1,1,4.0,0,1.0,1.0,5.0,0.0,0.0,1763.0
262952,1004465,1296,1,1,4.0,0,1.0,1.0,2.0,3.0,4.0,3240.0
262953,1004465,2733,1,1,4.0,0,1.0,1.0,8.0,0.0,0.0,5832.0
262954,1004465,1424,1,1,4.0,0,1.0,1.0,8.0,0.0,0.0,7788.0

In [87]:
dfw

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
70,1000018,3406,0,1,3.0,1,3.0,0.0,5.0,0.0,0.0,1780.0
71,1000018,1740,0,1,3.0,1,3.0,0.0,3.0,4.0,9.0,10754.0
72,1000018,1371,0,1,3.0,1,3.0,0.0,4.0,8.0,9.0,2802.0
73,1000018,990,0,1,3.0,1,3.0,0.0,1.0,2.0,5.0,19473.0
74,1000018,1048,0,1,3.0,1,3.0,0.0,1.0,2.0,0.0,19672.0
...,...,...,...,...,...,...,...,...,...,...,...,...
262414,1004387,264,0,1,4.0,1,0.0,0.0,8.0,0.0,0.0,7798.0
262415,1004387,1212,0,1,4.0,1,0.0,0.0,4.0,5.0,13.0,684.0
262450,1004398,978,0,1,4.0,2,2.0,0.0,8.0,0.0,0.0,7926.0
262451,1004398,3127,0,1,4.0,2,2.0,0.0,5.0,0.0,0.0,5183.0
262452,1004399,1736,0,1,4.0,2,1.0,1.0,4.0,12.0,0.0,3457.0

In [88]:
dfms = dfm.sample(1000, random_state = 1)
dfws = dfw.sample(1000, random_state = 7)

In [94]:
m_mean = dfms['Purchase'].mean()
m_mean

np.float64(9497.12)

In [95]:
w_mean = dfws['Purchase'].mean()
w_mean

np.float64(8494.924)

In [96]:
from scipy.stats import ttest_1samp

In [97]:
t_stat, p_val = ttest_1samp(dfms['Purchase'], m_mean)
print(p_val)

1.0

In [98]:
t_stat, p_val = ttest_1samp(dfws['Purchase'], w_mean)
print(p_val)

1.0